Autodesk.Revit.Exceptions.TransientElementCreationException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.TransientElementCreationException
The exception that is thrown when TransientElementCreationScope is used incorrectly.
Remarks: The exception would be thrown in the following cases:
An element that does not support TransientElementCreationScope is being created in the Scope. A TransientElementCreationScope is being created while another such scope is already active.
Since: 2016